app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "tel", "address", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fast & Slow"], ["tel", "02-1234-1234"], ["address", "청담동"], ["url", "http://fastandslow.com"], ["created_at", "2016-04-12 09:02:01.671357"], ["updated_at", "2016-04-12 09:02:01.671357"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save