app/controllers/trainers_controller.rb

  def index
    @trainers = Trainer.all
---
SELECT "trainers".* FROM "trainers"

  def create
    @trainer = Trainer.new(trainer_params)

    respond_to do |format|
      if @trainer.save
---
INSERT INTO "trainers" ("name", "tel", "sex", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_trainer
      @trainer = Trainer.find(params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT 1  [["id", 1]]