app/controllers/users_controller.rb

INSERT INTO "users" ("name", "tel", "sex", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "김주현"], ["tel", "01047987525"], ["sex", 1], ["email", "zuby@naver.com"], ["password", "123456"], ["created_at", "2016-04-12 09:07:10.263837"], ["updated_at", "2016-04-12 09:07:10.263837"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save