app/views/trainers/_form.html.erb

      <%= f.label :company %><br>
      <%= f.collection_select(:company_id, Company.all, :id, :name) %>
---
SELECT "companies".* FROM "companies"